--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  [PROJECT ROOT DIRECTORY FOLDER]/pvarsoc_results/pvarsoc_log.log
  log type:  text
 opened on:   5 Jul 2023, 11:00:33

. 
. 
. * load the data file

. cd "`input_path'"
[PROJECT ROOT DIRECTORY FOLDER]/data

. use "project-level-data.dta", clear

. 
. 
. 
. * Set directory to save results, logs, and charts

. cd "`output_path'"
[PROJECT ROOT DIRECTORY FOLDER]/pvarsoc_results

. 
. 
. 
. * Define independent variables for analysis

. local indepvars   p_respect_iss p_freedom_iss p_equity_iss p_broad_iss   p_power_iss p_enviro_iss 

. 
. 
. 
. 
. * Define unit_id and xtset for time series analysis

. encode project, gen(unit_id)   

. isid unit_id month

. xtset unit_id month

Panel variable: unit_id (unbalanced)
 Time variable: month, 2016m1 to 2021m12, but with gaps
         Delta: 1 month

. 
. 
. foreach indepvar in `indepvars' {
  2. * Iterate through each time group
. foreach time_group in "p_in_all" "p_out_a0_1" "p_out_a2_3" "p_out_a4_8" "p_out_a9up" {
  3. 
. * Fill in gaps with zeros
. replace `time_group'= 0 if `time_group'  == .
  4. 
. * Run pvarsoc for each independent variable
. di "-------------------"
  5. di "time_group == `time_group'."
  6. di "indepvar == `indepvar'."
  7. di "-------------------"
  8. 
. di "-------------------"
  9. pvarsoc `time_group' `indepvar' , pvaropts(instlags(1/6)) maxlag(6)
 10. di "-------------------"
 11. 
. 
. 
. }
 12. }
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_respect_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .6757206   27.12974   .1316532  -122.3203  -12.87026  -53.31945 |
  |     2 |  .8254578   23.18832   .1087922  -96.37169  -8.811676  -41.17103 |
  |     3 |   .858486   9.979526   .6177569  -79.69048  -14.02047  -38.28999 |
  |     4 |  .8660134   4.890482   .7692149  -54.88952  -11.10952  -27.28919 |
  |     5 |  .8687129    2.50537   .6436744  -27.38463   -5.49463  -13.58447 |
  |     6 |  .4039182          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(715 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_respect_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .7642931    13.2239   .8675721  -136.2261   -26.7761  -67.22529 |
  |     2 |  .7730943   9.874943   .8730769  -109.6851  -22.12506  -54.48441 |
  |     3 |  .7548966   5.306755   .9469406  -84.36325  -18.69325  -42.96276 |
  |     4 |  .7606108    3.67571   .8851334   -56.1043  -12.32429  -28.50397 |
  |     5 |    .78468   1.957048   .7436588  -27.93295  -6.042952  -14.13279 |
  |     6 | -22.81342          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(1,167 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_respect_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .5333076   15.98132   .7177824  -133.4687  -24.01868  -64.46787 |
  |     2 |  .6025865   12.44751   .7126429  -107.1125  -19.55249  -51.91185 |
  |     3 |  .6438917   8.405746   .7526735  -81.26426  -15.59425  -39.86377 |
  |     4 |  .6664833   4.343012   .8249261  -55.43699  -11.65699  -27.83666 |
  |     5 |  .6955858   3.958371   .4116691  -25.93163  -4.041629  -12.13147 |
  |     6 | -5.533288          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(1,059 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_respect_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .2876274   29.41182   .0799615  -120.0382  -10.58818  -51.03737 |
  |     2 |  .4966461   13.74846   .6174466  -105.8115  -18.25154  -50.61089 |
  |     3 |  .5857345   7.136789   .8484431  -82.53322  -16.86321  -41.13272 |
  |     4 |  .6387053   6.495009   .5919613    -53.285  -9.504991  -25.68467 |
  |     5 |  .6837547   6.106116   .1913624  -23.78389  -1.893884  -9.983722 |
  |     6 | -8.433064          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(397 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_respect_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .8028409   41.88669   .0028611  -107.5633   1.886694  -38.56249 |
  |     2 |  .7761016   23.59514   .0987275  -95.96487  -8.404859  -40.76421 |
  |     3 |  .7842369   20.25598   .0623959  -69.41402  -3.744016  -28.01353 |
  |     4 |  .7784222   9.713732   .2856958  -50.06627  -6.286268  -22.46594 |
  |     5 |  .7868045   9.979843   .0407686  -19.91016   1.979843  -6.109995 |
  |     6 | -6.827274          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_freedom_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .6551267   20.47646   .4285019  -128.9736  -19.52354  -59.97273 |
  |     2 |  .6581567   12.42572   .7141913  -107.1343  -19.57428  -51.93363 |
  |     3 |  .6697197   11.26321   .5065062   -78.4068  -12.73679   -37.0063 |
  |     4 |  .6679678    8.18747   .4153752  -51.59254   -7.81253  -23.99221 |
  |     5 |   .666733     3.8286   .4296989   -26.0614    -4.1714  -12.26124 |
  |     6 |  .4648553          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_freedom_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .4315142   17.65512   .6101156  -131.7949  -22.34488  -62.79407 |
  |     2 |  .4389768   10.50701   .8388453   -109.053  -21.49299  -53.85234 |
  |     3 |  .4452281    10.7803   .5478353  -78.88971   -13.2197  -37.48922 |
  |     4 |  .4356275   6.545577   .5863568  -53.23443  -9.454423   -25.6341 |
  |     5 |  .4599977   2.124203   .7129272   -27.7658  -5.875797  -13.96563 |
  |     6 |  -.711463          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_freedom_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .2457109   20.50615   .4266944  -128.9439  -19.49385  -59.94304 |
  |     2 |  .2416298   18.17719   .3136234  -101.3828  -13.82281  -46.18216 |
  |     3 |  .2219143   12.67641   .3929926   -76.9936  -11.32359   -35.5931 |
  |     4 |  .2068209   8.526376   .3838094  -51.25363  -7.473624   -23.6533 |
  |     5 |  .2411764   6.151187   .1881384  -23.73882  -1.848813   -9.93865 |
  |     6 | -.4584674          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_freedom_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .1577923   16.25991   .7003744  -133.1901  -23.74009  -64.18928 |
  |     2 |  .1359967    10.5458    .836616  -109.0142   -21.4542  -53.81355 |
  |     3 |  .1580553   8.601544   .7365341  -81.06846  -15.39846  -39.66797 |
  |     4 |  .1500329   7.807266     .45252  -51.97274  -8.192734  -24.37241 |
  |     5 |  .1244075   7.917221    .094658  -21.97278  -.0827793  -8.172617 |
  |     6 | -.2466311          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_freedom_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .4720761    50.9091   .0001639  -98.54092    10.9091  -29.54009 |
  |     2 |   .463704   19.49153   .2439995  -100.0685  -12.50847  -44.86782 |
  |     3 |  .4789542   18.22216   .1091096  -71.44785  -5.777838  -30.04735 |
  |     4 |  .4768793   13.94274   .0832702  -45.83727  -2.057262  -18.23694 |
  |     5 |  .4660955   10.42803   .0338029  -19.46197   2.428033  -5.661805 |
  |     6 | -.1831138          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_equity_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .5124165   24.30972   .2291248  -125.1403  -15.69028  -56.13947 |
  |     2 |   .429497   23.32731    .105261   -96.2327  -8.672691  -41.03204 |
  |     3 |  .4845507   12.41909   .4126357  -77.25092  -11.58091  -35.85042 |
  |     4 |  .5292435   9.207273   .3251136  -50.57273  -6.792727   -22.9724 |
  |     5 |  .5314683   3.189205   .5266763   -26.7008  -4.810795  -12.90063 |
  |     6 |  .4756991          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_equity_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .2328405   18.41294   .5602257  -131.0371  -21.58706  -62.03625 |
  |     2 |  .1626016   18.61132   .2893332  -100.9487  -13.38868  -45.74804 |
  |     3 |  .2560718   11.00938   .5281154  -78.66063  -12.99062  -37.26014 |
  |     4 |  .2454932   8.819895   .3577166  -50.96011  -7.180105  -23.35978 |
  |     5 |  .2702547   3.446665   .4860343  -26.44334  -4.553335  -12.64317 |
  |     6 | -1.082721          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_equity_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.2538176   22.07314   .3365549  -127.3769  -17.92686  -58.37605 |
  |     2 | -.2582619   20.64054   .1927453  -98.91947  -11.35946  -43.71881 |
  |     3 |  -.046258   9.556288    .654824  -80.11372  -14.44371  -38.71323 |
  |     4 | -.0213182    9.01966   .3406402  -50.76035   -6.98034  -23.16002 |
  |     5 | -.0139954   6.433643   .1690197  -23.45636  -1.566357  -9.656195 |
  |     6 |   -.39411          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_equity_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  -.104475   20.84715   .4061777  -128.6029  -19.15285  -59.60204 |
  |     2 | -.0901231   11.35975   .7867544  -108.2003  -20.64025   -52.9996 |
  |     3 | -.0909255   5.225095   .9500348  -84.44491   -18.7749  -43.04442 |
  |     4 | -.2838733   8.766522   .3623732  -51.01348  -7.233478  -23.41315 |
  |     5 | -.6449174     6.1557   .1878183   -23.7343    -1.8443  -9.934138 |
  |     6 | -.2499311          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_equity_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .2941315   39.63021   .0055613  -109.8198  -.3697887  -40.81898 |
  |     2 |  .1780347   23.96068   .0903667  -95.59933  -8.039315  -40.39867 |
  |     3 |  .2645374   14.03723    .298337  -75.63278  -9.962768  -34.23228 |
  |     4 |  .2299837   9.857376   .2751794  -49.92263  -6.142624   -22.3223 |
  |     5 |  .1349034   5.585427   .2323218  -24.30458  -2.414573  -10.50441 |
  |     6 | -.0716725          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_broad_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .0625674   39.61588   .0055844  -109.8341  -.3841236  -40.83331 |
  |     2 |  .5755448   22.92319   .1158034  -96.63682  -9.076813  -41.43616 |
  |     3 |  .5855269   20.53143   .0576776  -69.13858  -3.468573  -27.73809 |
  |     4 |  .5937889   16.56412   .0349818  -43.21589   .5641185  -15.61556 |
  |     5 |  .5984364   8.722587   .0684201  -21.16742   .7225868  -7.367251 |
  |     6 |  .4141347          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_broad_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .1772056   18.98766    .522628  -130.4624  -21.01234  -61.46152 |
  |     2 |  .1979703   16.94367   .3892515  -102.6163  -15.05633  -47.41569 |
  |     3 |  .3031598   7.985378    .786272  -81.68463  -16.01462  -40.28414 |
  |     4 |  .2747347   4.013739   .8558817  -55.76627  -11.98626  -28.16594 |
  |     5 |  .3048925   2.416163   .6597084  -27.47384  -5.583837  -13.67367 |
  |     6 | -1.923798          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_broad_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.5430467   32.71128   .0362844  -116.7387  -7.288724  -47.73791 |
  |     2 | -.3381844   25.04116   .0691031  -94.51885  -6.958838  -39.31819 |
  |     3 | -3.673759   9.444226   .6645919  -80.22578  -14.55577  -38.82529 |
  |     4 | -1.245329   10.93368   .2054854  -48.84633   -5.06632    -21.246 |
  |     5 | -.3066943   7.183034   .1265261  -22.70697  -.8169658  -8.906804 |
  |     6 | -.7903415          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_broad_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .0028905   25.23367   .1926372  -124.2163  -14.76633  -55.21552 |
  |     2 | -.0047868   27.86373   .0328251  -91.69628  -4.136273  -36.49562 |
  |     3 | -.2510558   15.01895    .240402  -74.65106  -8.981054  -33.25057 |
  |     4 | -.2819661   10.80863   .2127801  -48.97138  -5.191372  -21.37105 |
  |     5 | -.3191873   6.630903    .156727   -23.2591  -1.369097  -9.458935 |
  |     6 | -.3912256          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_broad_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .3883728   52.68016   .0000906  -96.76986   12.68016  -27.76903 |
  |     2 |  .3826607     38.368   .0013407  -81.19201   6.368002  -25.99135 |
  |     3 |   .394704   31.44291   .0016856   -58.2271   7.442913   -16.8266 |
  |     4 |  .3972617   25.24961   .0014101   -34.5304    9.24961  -6.930065 |
  |     5 |  .4131306   14.68898   .0053917  -15.20102   6.688983  -1.400855 |
  |     6 | -.3194185          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_power_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.4979374   46.54587    .000678  -102.9041   6.545871  -33.90332 |
  |     2 |  .4039877     23.582   .0990398  -95.97801  -8.417995  -40.77735 |
  |     3 |  .4483939   18.11045   .1123777  -71.55955  -5.889545  -30.15906 |
  |     4 |  .4549787   14.09999   .0791961  -45.68002  -1.900009  -18.07968 |
  |     5 |  .4570544   6.829156   .1451967  -23.06085  -1.170844  -9.260681 |
  |     6 |  .4082895          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_power_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .0149692   14.27795   .8161281  -135.1721  -25.72205  -66.17124 |
  |     2 |  .0433935   9.496561   .8915651  -110.0635  -22.50344  -54.86279 |
  |     3 |   .057131   9.776535   .6355578  -79.89347  -14.22346  -38.49298 |
  |     4 | -.1003634   10.97027   .2033895  -48.80974  -5.029731  -21.20941 |
  |     5 |  .1148295   2.693772   .6103048  -27.19623  -5.306228  -13.39607 |
  |     6 | -2.047568          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_power_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.1700731   17.51467   .6193457  -131.9353  -22.48533  -62.93452 |
  |     2 | -.1721902    13.5158   .6347359  -106.0442   -18.4842  -50.84355 |
  |     3 | -.1890633   10.74086   .5512478  -78.92915  -13.25914  -37.52865 |
  |     4 | -1.290496   8.918656   .3492045  -50.86135  -7.081344  -23.26102 |
  |     5 |  -1.17364   7.997586   .0916667  -21.89242  -.0024142  -8.092252 |
  |     6 | -.6245792          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_power_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.2678999   22.05434   .3375694  -127.3957  -17.94566  -58.39485 |
  |     2 | -.2889566   18.89109   .2743513  -100.6689  -13.10891  -45.46826 |
  |     3 | -.5618073   20.25219   .0624632  -69.41781  -3.747805  -28.01732 |
  |     4 | -.6684508    15.2609   .0542665   -44.5191  -.7390975  -16.91877 |
  |     5 | -.7880199   8.732093   .0681561  -21.15791   .7320926  -7.357745 |
  |     6 | -.4042356          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_power_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 |  .1904884    33.6288   .0287481  -115.8212  -6.371196  -46.82038 |
  |     2 |  .1752377    22.7766   .1198382  -96.78341  -9.223399  -41.58275 |
  |     3 |  .1841129   18.86935   .0917305  -70.80066  -5.130649  -29.40016 |
  |     4 |  .1757502   16.31545   .0380813  -43.46456   .3154509  -15.86422 |
  |     5 |  .1501514    10.1715   .0376358   -19.7185   2.171499  -5.918338 |
  |     6 |  -.350247          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_in_all.
indepvar == p_enviro_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -11.31471   65.60042   9.36e-07   -83.8496   25.60042  -14.84877 |
  |     2 | -.8798315   25.70351   .0583454   -93.8565  -6.296486  -38.65584 |
  |     3 | -.3870708   21.19844   .0475491  -68.47157  -2.801563  -27.07108 |
  |     4 |  .3845466    13.3884   .0991666  -46.39161  -2.611605  -18.79128 |
  |     5 |  .3941907   8.193809   .0847312  -21.69619   .1938086  -7.896029 |
  |     6 |  .3915516          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a0_1.
indepvar == p_enviro_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -1.212393   33.81455   .0274069  -115.6355  -6.185446  -46.63464 |
  |     2 |  .0589685   11.69318   .7648174  -107.8668  -20.30682  -52.66618 |
  |     3 | -1.536771   15.61915   .2093088  -74.05086   -8.38085  -32.65036 |
  |     4 | -.0211249   3.727165   .8808626  -56.05284  -12.27284  -28.45251 |
  |     5 |   .080974   3.782869   .4361882  -26.10713  -4.217131  -12.30697 |
  |     6 | -3.017938          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a2_3.
indepvar == p_enviro_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -8.015321   28.14827   .1059358  -121.3017  -11.85173  -52.30092 |
  |     2 | -3.432925   22.07945   .1406448  -97.48056  -9.920553   -42.2799 |
  |     3 | -1.115728   15.93002   .1944623  -73.73999  -8.069979  -32.33949 |
  |     4 | -1.595778   8.052415   .4283668  -51.72759  -7.947585  -24.12726 |
  |     5 |  -.948646   7.234435    .124006  -22.65557  -.7655652  -8.855403 |
  |     6 | -.5657406          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a4_8.
indepvar == p_enviro_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -.6682075   35.24058   .0188598  -114.2094  -4.759423  -45.20861 |
  |     2 | -.8346111   21.16161   .1723818   -98.3984  -10.83839  -43.19774 |
  |     3 | -3.160482   16.09806   .1867861  -73.57195  -7.901945  -32.17146 |
  |     4 |  -3.83199     12.472   .1313542  -47.30801  -3.528003  -19.70768 |
  |     5 |  -2.45121   9.396088   .0519268  -20.49391   1.396088  -6.693749 |
  |     6 | -.4060266          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------
(0 real changes made)
-------------------
time_group == p_out_a9up.
indepvar == p_enviro_iss.
-------------------
-------------------
Running panel VAR lag order selection on estimation sample
......

 Selection order criteria
 Sample:  678 - 742                                No. of obs      =      1759
                                                   No. of panels   =        40
                                                   Ave. no. of T   =    43.975

  +--------------------------------------------------------------------------+
  |   lag |    CD          J      J pvalue     MBIC       MAIC       MQIC    |
  |-------+------------------------------------------------------------------|
  |     1 | -19.92913   48.57962   .0003526  -100.8704   8.579615  -31.86957 |
  |     2 | -6.965631   35.72871   .0031551   -83.8313   3.728712  -28.63064 |
  |     3 | -4.623515   30.42886   .0024057  -59.24115   6.428863  -17.84065 |
  |     4 | -2.733815   26.95919   .0007185  -32.82082   10.95919  -5.220486 |
  |     5 | -1.805609   18.21144    .001122  -11.67856   10.21144   2.121606 |
  |     6 | -.2326995          .          .          .          .          . |
  +--------------------------------------------------------------------------+
-------------------

. 
. 
. 
. log close
      name:  <unnamed>
       log:  [PROJECT ROOT DIRECTORY FOLDER]/pvarsoc_results/pvarsoc_log.log
  log type:  text
 closed on:   5 Jul 2023, 11:02:27
--------------------------------------------------------------------------------------------------------------------------------------------------------
